This is a proof-of-concept of Open Data Node created by copying
and modifying 'benchmark' project. What needs to be done to
enhance this "copy" further:

a) transform SesameBenchmark into something like container or whatever
   (maybe even using OSGI) so that it loads and runs Harvester
   and other components (as sort of plug-ins)

   i) at first, we need to only split the code into appropriate
      classes and packages, all in one project

   ii) later we can thing about making it configurable so that ODN
       can be deployed in varying configurations (like somebody does
       not need certain harvesters and APIs so there would be a way to
       configure and deploy ODN to meet that criteria)

b) enhancing the Datanest CSV harvesters to be able to "re-run"
   and process only differences - i.e. we need to make them able to
   keep ODN copy of data up-to-date with Datanest "original"

c) adding more harvesters: direct harvesting of ORSR to get more data
   about companies, direct harvesting of procurement portals to have
   a shot by getting more data from the scanned documents themselves, ...

d) ...



Example SPARQL query: What companies are both giving donations to political
parties and participating in public procurement?

Go to http://ohio.in.eea.sk:8080/openrdf-workbench/repositories/datanest-combined/query
and submit following query:

PREFIX dc:<http://purl.org/dc/elements/1.1/>
PREFIX rdf:<http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX opendata:<http://sk.eea.opendata/2011/02/opendicts#>
PREFIX procurement:<http://opendata.cz/vocabulary/procurement.rdf#>
PREFIX skos:<http://www.w3.org/2004/02/skos/core#>
PREFIX pc:<http://opendata.cz/vocabulary/procurement.rdf#>
SELECT *
WHERE {
  ?supplier opendata:xSupplierIco ?suspectIco .
  ?donor opendata:xDonorIco ?suspectIco .
}


Expected results:

<http://opendata.sk/dataset/procurements/28991> "17703956" <http://opendata.sk/dataset/political_party_donations/1222>
...


FIXME: Work if I take RDF dumps from scrapers and carefully load them into
my Sesame without contexts. But does not work on ohio.in.eea.sk with RDF loaded
by this ODN. Seems like xSupplierIco is always "0" there. => Investigate and fix.
